[Killed] Equality mutation
BankAccount.cs:11:17
 
         public void Deposit(decimal v)
         {
-            if (v <= 0)
+            if (v > 0)
                 throw new ArgumentException();
 

[Killed] Negate expression
BankAccount.cs:11:17
 
         public void Deposit(decimal v)
         {
-            if (v <= 0)
+            if (!(v <= 0))
                 throw new ArgumentException();
 

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
BankAccount.cs:14:13
             if (v <= 0)
                 throw new ArgumentException();
 
-            Balance += v;
+            
+            Balance -=v;
         }
 

[Killed] Equality mutation
BankAccount.cs:19:17
 
         public void Withdraw(decimal v)
         {
-            if (v <= 0)
+            if (v < 0)
                 throw new ArgumentException();
             if(v>Balance)

[Killed] Equality mutation
BankAccount.cs:21:16
         {
             if (v <= 0)
                 throw new ArgumentException();
-            if(v>Balance)
+            if(v<Balance)
                 throw new InvalidOperationException();
 

[Killed] Negate expression
BankAccount.cs:21:16
         {
             if (v <= 0)
                 throw new ArgumentException();
-            if(v>Balance)
+            if(!(v>Balance))
                 throw new InvalidOperationException();
 

[Killed] SubtractAssignmentExpression to AddAssignmentExpression mutation
BankAccount.cs:24:13
             if(v>Balance)
                 throw new InvalidOperationException();
 
-            Balance -= v;
+            
+            Balance +=v;
 
         }
