[Killed] Logical mutation
OpeningHours.cs:57:20
         public bool IsOpen(DateTime time)
         {
             return
-                   days.ContainsKey(time.DayOfWeek) &&
-                   days[time.DayOfWeek].Start <= time.TimeOfDay &&
-                   days[time.DayOfWeek].End > time.TimeOfDay;
+                                      days.ContainsKey(time.DayOfWeek) &&
+                   days[time.DayOfWeek].Start <= time.TimeOfDay ||
+                   days[time.DayOfWeek].End > time.TimeOfDay;
         }
 

[Killed] Logical mutation
OpeningHours.cs:57:20
         public bool IsOpen(DateTime time)
         {
             return
-                   days.ContainsKey(time.DayOfWeek) &&
-                   days[time.DayOfWeek].Start <= time.TimeOfDay &&
+                                      days.ContainsKey(time.DayOfWeek) ||
+                   days[time.DayOfWeek].Start <= time.TimeOfDay  &&
                    days[time.DayOfWeek].End > time.TimeOfDay;
         }

[Killed] Equality mutation
OpeningHours.cs:58:20
         {
             return
                    days.ContainsKey(time.DayOfWeek) &&
-                   days[time.DayOfWeek].Start <= time.TimeOfDay &&
+                                      days[time.DayOfWeek].Start > time.TimeOfDay  &&
                    days[time.DayOfWeek].End > time.TimeOfDay;
         }

[Killed] Equality mutation
OpeningHours.cs:58:20
         {
             return
                    days.ContainsKey(time.DayOfWeek) &&
-                   days[time.DayOfWeek].Start <= time.TimeOfDay &&
+                                      days[time.DayOfWeek].Start < time.TimeOfDay  &&
                    days[time.DayOfWeek].End > time.TimeOfDay;
         }

[Killed] Equality mutation
OpeningHours.cs:59:20
             return
                    days.ContainsKey(time.DayOfWeek) &&
                    days[time.DayOfWeek].Start <= time.TimeOfDay &&
-                   days[time.DayOfWeek].End > time.TimeOfDay;
+                                      days[time.DayOfWeek].End >= time.TimeOfDay;
         }
 

[Killed] Equality mutation
OpeningHours.cs:59:20
             return
                    days.ContainsKey(time.DayOfWeek) &&
                    days[time.DayOfWeek].Start <= time.TimeOfDay &&
-                   days[time.DayOfWeek].End > time.TimeOfDay;
+                                      days[time.DayOfWeek].End < time.TimeOfDay;
         }
 
